app/Controllers/DistributorSalesController.php

SELECT *
FROM `selling_products`
WHERE `selling_products`.`deleted_at` IS NULL
SELECT *
FROM `gst_rates`
SELECT *
FROM `marketing_persons`
---
    public function create()
    {
        // Fetch all the data needed for the form from the respective models
        $data = [
            'title' => 'New Distributor Sales Order',
            'distributors' => $this->distributorModel->findAll(),
            'products' => $this->sellingProductModel->findAll(),
            'gstRates' => $this->gstRateModel->findAll(),
            'marketingPersons' => $this->marketingPersonModel->findAll(),
        ];

SELECT *
FROM `distributor_sales_orders`
WHERE `distributor_sales_orders`.`id` = '13'
SELECT *
FROM `distributors`
WHERE `distributors`.`id` = '10'
SELECT *
FROM `marketing_persons`
WHERE `marketing_persons`.`id` = '1'
SELECT *
FROM `distributor_sales_order_items`
WHERE `distributor_sales_order_id` = '13'
SELECT *
FROM `distributor_payments`
WHERE `distributor_sales_order_id` = '13'
---
    public function view($id = null)
    {
        // 1. Ensure an ID is provided
        if ($id === null) {
            return redirect()->to(site_url('distributor-sales'))->with('error', 'No sales order ID provided.');
        }

        // 2. Load all necessary models
        $salesModel = new DistributorSalesOrderModel();
        $distributorModel = new DistributorModel();
        $marketingPersonModel = new MarketingPersonModel();
        $salesItemModel = new DistributorSalesOrderItemModel();
        $paymentModel = new DistributorPaymentModel();
        $sellingProductModel = new SellingProductModel();
        $unitModel = new UnitModel();
        $gstRateModel = new GstRateModel();

        // 3. Fetch the sales order
        $salesOrder = $salesModel->find($id);

        if (!$salesOrder) {
            return redirect()->to(site_url('distributor-sales'))->with('error', 'Sales order not found.');
        }

        // 4. Fetch all related data for the view
        $distributor = $distributorModel->find($salesOrder['distributor_id']);
        $marketingPerson = $marketingPersonModel->find($salesOrder['marketing_person_id']);
        $salesOrderItems = $salesItemModel->where('distributor_sales_order_id', $id)->findAll();
        $payments = $paymentModel->where('distributor_sales_order_id', $id)->findAll();

SELECT *
FROM `selling_products`
WHERE `selling_products`.`deleted_at` IS NULL
AND `selling_products`.`id` = '1'
SELECT *
FROM `units`
WHERE `units`.`id` = '1'
---

        // 5. Loop through sales order items to fetch product details
        foreach ($salesOrderItems as $key => $item) {
            $product = $sellingProductModel->find($item['product_id']);
            if ($product) {
                $salesOrderItems[$key]['product_name'] = $product['name'];
                $unit = $unitModel->find($product['unit_id'] ?? null);

SELECT *
FROM `gst_rates`
WHERE `id` IN ('2')
---
                }
            }
            if (!empty($idsToQuery)) {
                $gst_rates_details = $gstRateModel->whereIn('id', $idsToQuery)->findAll();

SELECT *
FROM `distributor_sales_orders`
WHERE `distributor_sales_orders`.`id` = 13
---
    public function edit(int $id): string
    {
        // Load necessary models
        $salesOrderModel = new DistributorSalesOrderModel();
        $distributorModel = new DistributorModel();
        $marketingPersonModel = new MarketingPersonModel();
        $sellingProductModel = new SellingProductModel();
        $salesOrderItemModel = new DistributorSalesOrderItemModel();
        $unitModel = new UnitModel();
        $gstRateModel = new GstRateModel();
        $distributorPaymentModel = new DistributorPaymentModel(); // New model instance

        // Fetch the sales order and associated items
        $sales_order = $salesOrderModel->find($id);

SELECT *
FROM `distributors`
SELECT *
FROM `marketing_persons`
SELECT *
FROM `selling_products`
WHERE `selling_products`.`deleted_at` IS NULL
SELECT *
FROM `units`
SELECT *
FROM `gst_rates`
SELECT *
FROM `distributor_payments`
WHERE `distributor_sales_order_id` = 13
---
        // --- END OF FIX ---

        // Fetch related data for dropdowns
        $distributors = $distributorModel->findAll();
        $marketing_persons = $marketingPersonModel->findAll();
        $products = $sellingProductModel->findAll();
        $units = $unitModel->findAll();
        $gst_rates = $gstRateModel->findAll();

        // New: Fetch existing payment records for the sales order
        $payments = $distributorPaymentModel->where('distributor_sales_order_id', $id)->findAll();

SELECT *
FROM `distributor_sales_order_items`
WHERE `distributor_sales_order_id` = 13
SELECT *
FROM `selling_products`
WHERE `selling_products`.`deleted_at` IS NULL
AND `selling_products`.`id` = '1'
SELECT *
FROM `units`
WHERE `units`.`id` = '1'
---
        }

        // Fetch sales order items and enrich them with product details
        $sales_order_items = $salesOrderItemModel->where('distributor_sales_order_id', $id)->findAll();
        foreach ($sales_order_items as &$item) {
            $product = $sellingProductModel->find($item['product_id']);
            if ($product) {
                $item['product_name'] = $product['name'];
                $item['gst_rate_id'] = $product['gst_rate_id'] ?? null;
                $unit = $unitModel->find($product['unit_id']);