app/Controllers/Distributor.php

    public function index(): string
    {
        $data = [
            'title'        => 'Distributors List',
            'distributors' => $this->distributorModel->orderBy('created_at', 'DESC')->findAll(),
---
SELECT *
FROM `distributors`
ORDER BY `created_at` DESC