app/Controllers/DistributorSalesController.php

SELECT `distributor_sales_orders`.*, `distributors`.`agency_name`
FROM `distributor_sales_orders`
JOIN `distributors` ON `distributors`.`id` = `distributor_sales_orders`.`distributor_id`
ORDER BY `invoice_date` DESC, `distributor_sales_orders`.`id` DESC
---
    public function index()
    {
        $data = [
            'title'        => 'Distributor Sales Orders',
            'sales_orders' => $this->distributorSalesOrderModel
                ->select('distributor_sales_orders.*, distributors.agency_name')
                ->join('distributors', 'distributors.id = distributor_sales_orders.distributor_id')
                ->orderBy('invoice_date', 'DESC') // Sort by most recent invoice date first
                ->orderBy('distributor_sales_orders.id', 'DESC') // Then by ID (newest ID first for same date)
                ->findAll(),
        ];

SELECT *
FROM `gst_rates`
WHERE `id` IN ('12')
---
        $selectedGstRates = []; // To store actual rates for calculation and display
        foreach ($overallGstRateIds as $gstId) {
            try {
                $gstRate = $this->gstRateModel->find($gstId);

INSERT INTO `distributor_sales_orders` (`distributor_id`, `marketing_person_id`, `pricing_tier`, `invoice_number`, `invoice_date`, `sub_total`, `total_amount_before_gst`, `total_gst_amount`, `discount_amount`, `final_total_amount`, `amount_paid`, `due_amount`, `status`, `overall_gst_rate_ids`, `overall_gst_percentage_at_sale`, `notes`, `created_at`, `updated_at`) VALUES ('10', '8', 'farmer', 'INV-202508140011', '2025-08-14', 200, 196, 35.28, 4, 231.28, 0, 231.28, 'Pending', '[\"12\"]', 18, '', '2025-08-14 06:59:05', '2025-08-14 06:59:05')
---
                'notes'                     => $notes,
            ];

            $salesOrderId = $this->distributorSalesOrderModel->insert($salesOrderData);

INSERT INTO `distributor_sales_order_items` (`created_at`, `distributor_sales_order_id`, `gst_rate_id`, `item_total`, `product_id`, `quantity`, `unit_price_at_sale`, `updated_at`)
VALUES ('2025-08-14 06:59:05',67,NULL,200,'15','1','200.00','2025-08-14 06:59:05')
---
            foreach ($salesOrderItemsData as $item) {
                $item['distributor_sales_order_id'] = $salesOrderId;
                // No need for gst_rate_id, gst_rate_at_sale, item_gst_amount, item_final_total in item data
                $insertedItemId = $this->distributorSalesOrderItemModel->insert($item, true);