app/Controllers/Distributor.php

SELECT *
FROM `distributors`
ORDER BY `agency_name` ASC
---
    public function index(): string
    {
        $data = [
            'title'        => 'Distributors List',
            'distributors' => $this->distributorModel->orderBy('agency_name', 'ASC')->findAll(),
        ];

SELECT *
FROM `distributors`
WHERE `distributors`.`id` = 2
---
    public function view(int $id): string | ResponseInterface
    {
        $distributor = $this->distributorModel->find($id);