app/Controllers/DistributorSalesController.php

    public function index()
    {
        $data = [
            'title'        => 'Distributor Sales Orders',
            'sales_orders' => $this->distributorSalesOrderModel
                ->select('distributor_sales_orders.*, distributors.agency_name')
                ->join('distributors', 'distributors.id = distributor_sales_orders.distributor_id')
                ->orderBy('invoice_date', 'DESC')
                ->findAll(),
---
SELECT `distributor_sales_orders`.*, `distributors`.`agency_name`
FROM `distributor_sales_orders`
JOIN `distributors` ON `distributors`.`id` = `distributor_sales_orders`.`distributor_id`
ORDER BY `invoice_date` DESC