app/Controllers/GstRates.php

SELECT *
FROM `gst_rates`
---
    public function index()
    {
        $data = [
            'gstRates' => $this->gstRateModel->findAll(),
            'title'    => 'Manage GST Rates'
        ];