app/Controllers/MarketingDistribution.php

    private function calculateAvailableStock(int $productId): int
    {
        $stockIn = $this->db->table('stock_in')
            ->selectSum('quantity')
            ->where('product_id', $productId)
            ->get()
            ->getRow()->quantity ?? 0;

        $stockOut = $this->db->table('stock_out')
            ->selectSum('quantity_out')
            ->where('product_id', $productId)
            ->get()
            ->getRow()->quantity_out ?? 0;
---
SELECT SUM(`quantity`) AS `quantity`
FROM `stock_in`
WHERE `product_id` = 3
SELECT SUM(`quantity_out`) AS `quantity_out`
FROM `stock_out`
WHERE `product_id` = 3

        }
        unset($dist); // Unset the reference to avoid issues in later loops

        $data['products'] = $this->productModel->select('products.id, products.name, units.name as unit_name')
                               ->join('units', 'units.id = products.unit_id')
                               ->findAll();
        $data['marketing_persons'] = $this->marketingPersonModel->findAll();
---
SELECT `products`.`id`, `products`.`name`, `units`.`name` as `unit_name`
FROM `products`
JOIN `units` ON `units`.`id` = `products`.`unit_id`
SELECT *
FROM `marketing_persons`

    public function edit($id = null)
    {
        $distribution = $this->distributionModel->find($id);
        if (!$distribution) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound('Record not found');
        }
        $data['distribution'] = $distribution;
        // Get products with unit names
        $data['products'] = $this->productModel->select('products.id, products.name, units.name as unit_name')
                               ->join('units', 'units.id = products.unit_id')
                               ->findAll();
        $data['marketing_persons'] = $this->marketingPersonModel->findAll();
---
SELECT `products`.`id`, `products`.`name`, `units`.`name` as `unit_name`
FROM `products`
JOIN `units` ON `units`.`id` = `products`.`unit_id`
SELECT *
FROM `marketing_persons`