app/Controllers/Products.php

SELECT *
FROM `products`
---
    public function managePrices(): string
    {
        $products = $this->productModel->findAll(); // Fetches all products