app/Controllers/Products.php

SELECT `products`.*, `units`.`name` as `unit_name`
FROM `products`
JOIN `units` ON `units`.`id` = `products`.`unit_id`
---
    public function index()
    {
        // Fetch products with unit name using join
        $builder = $this->productModel->builder();
        $builder->select('products.*, units.name as unit_name');
        $builder->join('units', 'units.id = products.unit_id');
        $products = $builder->get()->getResultArray();

SELECT SUM(`quantity`) AS `quantity`
FROM `stock_in`
WHERE `product_id` = 4
SELECT SUM(`quantity_out`) AS `quantity_out`
FROM `stock_out`
WHERE `product_id` = 4
SELECT `units`.`name` as `unit_name`
FROM `products`
JOIN `units` ON `units`.`id` = `products`.`unit_id`
WHERE `products`.`id` = 4
---
    public function getAvailableStock(int $productId)
    {
        // Calculate available stock using stock_in and stock_out tables
        $stockIn = $this->db->table('stock_in')
            ->selectSum('quantity')
            ->where('product_id', $productId)
            ->get()
            ->getRow()->quantity ?? 0;

        $stockOut = $this->db->table('stock_out')
            ->selectSum('quantity_out')
            ->where('product_id', $productId)
            ->get()
            ->getRow()->quantity_out ?? 0;

        $availableStock = $stockIn - $stockOut;

        // Fetch the unit name for the product
        $product = $this->productModel->select('units.name as unit_name')
                                    ->join('units', 'units.id = products.unit_id')
                                    ->find($productId);