app/Controllers/Sales.php

SELECT `sales`.*, `products`.`name` as `product_name`, `units`.`name` as `unit_name`, `marketing_persons`.`name` as `person_name`, `marketing_persons`.`custom_id`
FROM `sales`
JOIN `products` ON `products`.`id` = `sales`.`product_id`
JOIN `units` ON `units`.`id` = `products`.`unit_id`
JOIN `marketing_persons` ON `marketing_persons`.`id` = `sales`.`marketing_person_id`
SELECT *
FROM `products`
SELECT *
FROM `marketing_persons`
---
    public function index()
    {
        $builder = $this->salesModel->builder();
        $builder->select('sales.*, products.name as product_name, marketing_persons.name as person_name, marketing_persons.custom_id');
        $builder->join('products', 'products.id = sales.product_id');
        $builder->join('marketing_persons', 'marketing_persons.id = sales.marketing_person_id');

        if ($productId = $this->request->getGet('product_id')) {
            $builder->where('sales.product_id', $productId);
        }

        if ($personId = $this->request->getGet('marketing_person_id')) {
            $builder->where('sales.marketing_person_id', $personId);
        }

        if ($dateSold = $this->request->getGet('date_sold')) {
            $builder->where('sales.date_sold', $dateSold);
        }

        if ($customerName = $this->request->getGet('customer_name')) {
            $builder->like('sales.customer_name', $customerName);
        }

        $data['sales'] = $builder->get()->getResultArray();
        $data['products'] = $this->productModel->findAll();
        $data['marketing_persons'] = $this->personModel->findAll();

SELECT *
FROM `marketing_persons`
SELECT *
FROM `products`
---
    public function create()
    {
        return view('sales/create', [
            'products' => $this->productModel->findAll(),
            'marketing_persons' => $this->personModel->findAll()
        ]);

SELECT `sales`.*, `products`.`name` as `product_name`, `marketing_persons`.`name` as `person_name`, `marketing_persons`.`custom_id`
FROM `sales`
JOIN `products` ON `products`.`id` = `sales`.`product_id`
JOIN `marketing_persons` ON `marketing_persons`.`id` = `sales`.`marketing_person_id`
WHERE `sales`.`id` = '4'
---
    public function edit($id)
    {
        $sale = $this->salesModel->find($id);
        if (!$sale) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound('Sale not found');
        }

        return view('sales/edit', [
            'sale' => $sale,
            'products' => $this->productModel->findAll(),
            'marketing_persons' => $this->personModel->findAll()
        ]);