app/Controllers/StockIn.php

SELECT `stock_in`.*, `products`.`name` as `product_name`, `units`.`name` as `unit_name`, `vendors`.`agency_name` as `vendor_agency_name`, `vendors`.`name` as `vendor_name`, `gst_rates`.`name` as `gst_rate_name`, (gst_rates.rate * 100) as gst_rate_percentage
FROM `stock_in`
JOIN `products` ON `products`.`id` = `stock_in`.`product_id`
JOIN `units` ON `units`.`id` = `products`.`unit_id`
LEFT JOIN `vendors` ON `vendors`.`id` = `stock_in`.`vendor_id`
LEFT JOIN `gst_rates` ON `gst_rates`.`id` = `stock_in`.`gst_rate_id`
ORDER BY `stock_in`.`id` DESC
---
    public function index()
    {
        $builder = $this->stockInModel->builder();
        $builder->select('
            stock_in.*,
            products.name as product_name,
            units.name as unit_name,
            vendors.agency_name as vendor_agency_name,
            vendors.name as vendor_name,
            gst_rates.name as gst_rate_name,
            (gst_rates.rate * 100) as gst_rate_percentage
        ');
        $builder->join('products', 'products.id = stock_in.product_id');
        $builder->join('units', 'units.id = products.unit_id');
        $builder->join('vendors', 'vendors.id = stock_in.vendor_id', 'left');
        $builder->join('gst_rates', 'gst_rates.id = stock_in.gst_rate_id', 'left');
        $builder->orderBy('stock_in.id', 'DESC');

        $data['stock_entries'] = $builder->get()->getResultArray();

SELECT `stock_in`.*, `vendors`.`agency_name` as `vendor_agency_name`, `vendors`.`name` as `vendor_name`, `products`.`name` as `product_name`, `units`.`name` as `unit_name`, `gst_rates`.`name` as `gst_rate_name`, `gst_rates`.`rate` as `gst_rate_percentage`
FROM `stock_in`
JOIN `vendors` ON `vendors`.`id` = `stock_in`.`vendor_id`
JOIN `products` ON `products`.`id` = `stock_in`.`product_id`
JOIN `units` ON `units`.`id` = `products`.`unit_id`
JOIN `gst_rates` ON `gst_rates`.`id` = `stock_in`.`gst_rate_id`
WHERE `stock_in`.`id` = '34'
SELECT *
FROM `stock_in_payments`
WHERE `stock_in_id` = '34'
ORDER BY `payment_date` ASC
---
    public function view($id)
    {
        // Fetch the main stock in entry details
        $stockInEntry = $this->stockInModel
            ->select('stock_in.*,
                                       vendors.agency_name as vendor_agency_name, vendors.name as vendor_name,
                                       products.name as product_name,
                                       units.name as unit_name,
                                       gst_rates.name as gst_rate_name, gst_rates.rate as gst_rate_percentage')
            ->join('vendors', 'vendors.id = stock_in.vendor_id')
            ->join('products', 'products.id = stock_in.product_id')
            ->join('units', 'units.id = products.unit_id')
            ->join('gst_rates', 'gst_rates.id = stock_in.gst_rate_id')
            ->find($id);

        if (empty($stockInEntry)) {
            session()->setFlashdata('error', 'Stock In entry not found.');
            return redirect()->to(base_url('stock-in'));
        }

        // Fetch all payments related to this stock in entry
        $stockInPayments = $this->stockInPaymentModel
            ->where('stock_in_id', $id)
            ->orderBy('payment_date', 'asc') // Order by date for better readability
            ->findAll();