app/Controllers/StockOut.php

SELECT `stock_out`.*, `products`.`name` as `product_name`
FROM `stock_out`
JOIN `products` ON `products`.`id` = `stock_out`.`product_id`
WHERE `stock_out`.`product_id` = '7'
ORDER BY `stock_out`.`issued_date` DESC, `stock_out`.`id` DESC
SELECT `id`, `name`
FROM `products`
SELECT DISTINCT `transaction_type`
FROM `stock_out`
---
    public function index(): string
    {
        $product_id = $this->request->getGet('product_id');
        $transaction_type = $this->request->getGet('transaction_type');
        $issued_date_start = $this->request->getGet('issued_date_start');
        $issued_date_end = $this->request->getGet('issued_date_end');

        // Build the query
        $builder = $this->stockOutModel->builder();
        $builder->select('stock_out.*, products.name as product_name');
        $builder->join('products', 'products.id = stock_out.product_id');

        // Apply filters
        if (!empty($product_id)) {
            $builder->where('stock_out.product_id', $product_id);
        }
        if (!empty($transaction_type)) {
            $builder->where('stock_out.transaction_type', $transaction_type);
        }
        if (!empty($issued_date_start)) {
            $builder->where('stock_out.issued_date >=', $issued_date_start);
        }
        if (!empty($issued_date_end)) {
            $builder->where('stock_out.issued_date <=', $issued_date_end);
        }

        $stockOutRecords = $builder->orderBy('stock_out.issued_date DESC, stock_out.id DESC')->get()->getResultArray();

        // Fetch all products and transaction types for filter dropdowns
        $products = $this->productModel->select('id, name')->findAll();
        $allTransactionTypes = $this->stockOutModel->distinct()->select('transaction_type')->findAll();

SELECT `sales`.*, `marketing_persons`.`name` as `marketing_person_name`, `marketing_persons`.`custom_id` as `marketing_person_custom_id`
FROM `sales`
LEFT JOIN `marketing_persons` ON `marketing_persons`.`id` = `sales`.`marketing_person_id`
WHERE `sales`.`id` = '14'
---

            if ($record['transaction_type'] === 'Sale' && !empty($record['transaction_id'])) {
                // Fetch sale and marketing person details if transaction_type is Sale
                $sale = $this->salesModel->select('sales.*, marketing_persons.name as marketing_person_name, marketing_persons.custom_id as marketing_person_custom_id')
                    ->join('marketing_persons', 'marketing_persons.id = sales.marketing_person_id', 'left')
                    ->find($record['transaction_id']);

SELECT `marketing_distribution`.*, `marketing_persons`.`name` as `marketing_person_name`, `marketing_persons`.`custom_id` as `marketing_person_custom_id`, `marketing_persons`.`phone` as `marketing_person_phone`
FROM `marketing_distribution`
LEFT JOIN `marketing_persons` ON `marketing_persons`.`id` = `marketing_distribution`.`marketing_person_id`
WHERE `marketing_distribution`.`id` = '15'
---
                }
            } elseif ($record['transaction_type'] === 'marketing_distribution' && !empty($record['transaction_id'])) {
                // Fetch marketing distribution and marketing person details
                $distribution = $this->marketingDistributionModel
                    ->select('marketing_distribution.*, marketing_persons.name as marketing_person_name, marketing_persons.custom_id as marketing_person_custom_id, marketing_persons.phone as marketing_person_phone')
                    ->join('marketing_persons', 'marketing_persons.id = marketing_distribution.marketing_person_id', 'left')
                    ->find($record['transaction_id']);

SELECT `distributor_sales_orders`.*, `distributors`.`agency_name`, `distributors`.`owner_name`, `distributors`.`id` as `distributor_db_id`
FROM `distributor_sales_orders`
LEFT JOIN `distributors` ON `distributors`.`id` = `distributor_sales_orders`.`distributor_id`
WHERE `distributor_sales_orders`.`id` = '14'
---
                }
            } elseif ($record['transaction_type'] === 'distributor_sale' && !empty($record['transaction_id'])) {
                // Fetch distributor sales order and distributor details
                $distributorSale = $this->distributorSalesOrderModel
                    ->select('distributor_sales_orders.*, distributors.agency_name, distributors.owner_name, distributors.id as distributor_db_id')
                    ->join('distributors', 'distributors.id = distributor_sales_orders.distributor_id', 'left')
                    ->find($record['transaction_id']);