app/Controllers/StockOut.php

    public function issue(): string
    {
        $products = $this->productModel->select('id, name, selling_price')->findAll();
---
SELECT `id`, `name`, `selling_price`
FROM `products`