app/Controllers/Vendors.php

SELECT *
FROM `vendors`
---
    public function update($id)
    {
        $data = [
            'agency_name'    => $this->request->getPost('agency_name'),
            'name'           => $this->request->getPost('name'),
            'owner_phone'    => $this->request->getPost('owner_phone'),
            'contact_person' => $this->request->getPost('contact_person'),
            'contact_phone'  => $this->request->getPost('contact_phone'),
            'email'          => $this->request->getPost('email'),
            'address'        => $this->request->getPost('address'),
        ];

        if ($this->vendorModel->update($id, $data)) {
            return redirect()->to('/vendors')->with('success', 'Vendor updated successfully');