app/Models/StockConsumptionModel.php

    public function getConsumptionEntriesWithDetails()
    {
        return $this->select('stock_consumption.*, purchased_products.name AS product_name, units.name AS unit_name')
                    ->join('purchased_products', 'purchased_products.id = stock_consumption.product_id')
                    ->join('units', 'units.id = purchased_products.unit_id')
                    ->findAll();
---
SELECT `stock_consumption`.*, `purchased_products`.`name` AS `product_name`, `units`.`name` AS `unit_name`
FROM `stock_consumption`
JOIN `purchased_products` ON `purchased_products`.`id` = `stock_consumption`.`product_id`
JOIN `units` ON `units`.`id` = `purchased_products`.`unit_id`